# задание номер 4 игра консольная


player_hp = 100
player_st = 30
player_inventory = []

player_x = 0
player_y = 0

karta = [
    ['ничего', 'ничего1', 'ничего', 'ничего' , 'ничего1' , 'ловушка'],
    ['ничего', 'ничего', 'меч', 'монстр' , 'телепорт' , 'ничего'],
    ['копье', 'ловушка', 'монстр', 'ничего' , 'ничего' , 'ничего'],
    ['сундук', 'ничего', 'ничего1', 'ничего' , 'сундук' , 'ничего1'],
    ['ловушка', 'ничего', 'ничего', 'ничего' , 'сундук' , 'ловушка'],
    ['письмо', 'ловушка', 'сундук', 'ничего' , 'монстр' , 'выход'],
]
max_y = len(karta)-1
max_x = len(karta[0])-1


game_start = True


print('===== БЛУЖДАЮЩИЙ ВО ТЬМЕ =====')
name = str(input('Введи свое имя, если еще помнишь его:'))

pravila = int(input('Сделать первый шаг во тьму (нажми 1) или попытаться вспомнить, что делать (нажми 2):\n'))

if pravila == 2:
    print(f'\nТы резко открываешь глаза, {name}. Вокруг — глухие влажные стены бесконечного лабиринта. Ты не знаешь, как здесь оказался.\n')
    print('Внутри пустота. Тебе холодно, страшно и одиноко, словно ты брошен всем миром в этой темноте.\n')
    print('В голове бьется только одна мысль: нужно найти выход и хоть какую-то зацепку, чтобы спастись,\nиначе ты останешься здесь навсегда.\n')
    print(f'Твои силы на исходе (Здоровье: {player_hp} hp). Во тьме скрываются ужасы и ловушки, но нужно двигаться вперед...\n')
    
elif pravila == 1:
    print('Ты делаешь неуверенный шаг во тьму...\n')

else:
    print('Нажми 1 или 2')
    
while game_start:
    
    cnp = str(input('Твой ход : \n( w - вверх ; s - вниз ; a - влево ; d - вправо ; i - инвентарь; q - выход;)\n')).lower()

    if cnp == 'q':
        print('=== ТЫ ОСТАЛСЯ В КОШМАРЕ НАВСЕГДА (ВЫ ПРОИГРАЛИ) ===\n')
        game_start = False
        
    elif cnp == 'i':
        print('\n=== ТВОЙ МИР ===')
        print(f'Здоровье: {player_hp} hp')
        print(f'Выносливость: {player_st} ед.')
        if len(player_inventory) > 0:
            print(f'Инвентарь : {" ".join(player_inventory)}')
            print('===================\n')
        else:
            print('Инвентарь: пусто')
            print('===================\n')
        continue

       
    # реализация ходов 
    elif cnp in ['w','s','a','d']:
        
        old_x = player_x
        old_y = player_y
        
        if cnp == 'w':
            player_y -= 1
        elif cnp == 's':
            player_y += 1
        elif cnp == 'a':
            player_x -= 1
        elif cnp == 'd':
            player_x += 1
            
        if player_y < 0 or player_y > max_y or player_x < 0 or player_x > max_x:
            player_x = old_x
            player_y = old_y
            print('Ой! кажется ты уперся в стену. \n')
        
        else:
            if player_st > 0:
                player_st -= 1
            else:
                print('Ты сильно устал! Каждый шаг дается с болью (-5 hp).\n')
                player_hp -= 5
            
            print(f'Ты сделал шаг, твои текущие координаты: \nx = {player_x} y = {player_y}\n')
            print(f'Осталось выносливости: {player_st}\n')
            
            drop = karta[player_y][player_x]
            
            if drop == 'письмо':
                player_inventory.append('письмо')
                print('Среди мрака ты замечаешь странный свернутый лист бумаги. От него исходит слабое теплое свечение...\n')
                print('Тебе становится чуть спокойнее. Ты аккуратно прячешь его в инвентарь. Кажется, это ключ к спасению!\n')
                karta[player_y][player_x] = 'ничего'
                
            elif drop == 'меч':
                player_inventory.append('меч')
                karta[player_y][player_x] = 'ничего'
                print('Ты нашел МЕЧ\nтеперь можешь сражаться с монстрами\n')
            
            elif drop == 'копье':
                player_inventory.append('копье')
                karta[player_y][player_x] = 'ничего'
                print('Ты нашел КОПЬЕ\nтеперь можешь обезвреживать ловушки\n')

            elif drop == 'ловушка':
                if 'копье' in player_inventory:
                    print('В этой пыльной комнате ловушка, но у тебя есть копье, и ты ее обезвредил, но остался без копья\n')
                    karta[player_y][player_x] = 'ничего'
                    player_inventory.remove('копье')
                else:
                    player_hp -= 15
                    print('БАЦ !!! В этой комнате оказалась ловушка \nу тебя - 15 hp \n')
                    karta[player_y][player_x] = 'ничего'
                
            elif drop == 'монстр':
                if 'меч' in player_inventory:
                    print('В этой комнате МОНСТР\nно у тебя есть меч, и ты его победил, увы меч сломался, придется искать новый\n')
                    karta[player_y][player_x] = 'ничего'
                    player_inventory.remove('меч')
                else:
                    player_hp -= 30
                    print('AAAAA ЭТО МОНСТР !!! \nу тебя - 30 hp \n')
                    print('Вроде убежала падла\n')
                    karta[player_y][player_x] = 'ничего'
                
            elif drop == 'сундук':
                player_hp += 25
                print('Вы зашли в комнату и перед вами СУНДУК\nоткрыв его вы увидели зелье\nпоздравляем у вас + 25 hp \n')
                karta[player_y][player_x] = 'ничего'
                if player_hp > 100:
                    player_hp = 100
                
            elif drop == 'выход':
                if 'письмо' in player_inventory:
                    print('\n=== ТУПИК? НЕТ, ЭТО ВЫХОД ===\n')
                    print('Ты упираешься в огромную черную дверь. Тьма вокруг сгущается, становится невыносимо страшно.\n')
                    print('Дрожащими руками ты достаешь найденное светящееся письмо и разворачиваешь его...\n')
                    print('Внезапно буквы вспыхивают ярким светом, ослепляя тебя! Стены холодного лабиринта с грохотом растворяются!')
                    print('...')
                    print('Ты резко садишься, жадно хватая ртом воздух, и в холодном поту оглядываешься по сторонам.\n')
                    print('Знакомые стены комнаты в общежитии Горняк-1. На столе тихо гудит твой Макбук, на экране светится код в VS Code.\n')
                    print('Ты понимаешь, что этот бесконечный ужас и одиночество — просто кошмар после тяжелого дня в МИСИС.\n')
                    print('Страх окончательно отступает, уступая место невероятному облегчению. Ты ЖИВ.\n')
                    print('=== ПОЗДРАВЛЯЕМ! ВЫ ПРОСНУЛИСЬ, ИГРА ПРОЙДЕНА ===\n')
                    game_start = False
                else:
                    print('\nТы нашел огромную черную дверь. Это выход, но она наглухо заперта.\n')
                    print('Чего-то не хватает... Какой-то важной детали, чтобы разрушить этот морок. Нужно продолжать поиски во тьме.\n')
                    
            elif drop == 'телепорт':
                player_x = 1
                player_y = 4
                print('ОГО это телепорт теперь ты снова в другом месте\n')
                print(f'твои текущие координаты: \nx = {player_x} y = {player_y}\n')
                
            elif drop == 'ничего':
                print('Ты попал в мрачную сырую комнату\nв ней ничего нет ...\n')
            
            elif drop == 'ничего1':
                print('Ты попал в пыльную комнату с крысами\nно увы кроме крыс в ней ничего нет ...\n')
                    
            print(f'Твое здоровье {player_hp} hp\n')
            if player_hp <= 0:
                print('Ваше здоровье упало до нуля ===ВЫ ПРОИГРАЛИ===\n')
                game_start = False
            
        
    else:
        print('Неизвестная команда попробуй использовать: w  s  a  d  i или q')
    