# print('Привет пользователь у тебя есть на выбор 3 команды котрые преобразуют твою строку.')
# print('Кнопка 1 - это lower(): Преобразует все символы строки в нижний регистр.')
# print('Кнопка 2 - это upper(): Преобразует все символы строки в верхний регистр.')
# print('Кнопка 3 - это capitalize(): Делает первый символ строки заглавным, а все остальные переводит в нижний регистр.')
# x = int(input('Выберите 1, 2 ,3'))
# y = str(input('Напиши сюда произвольную строку, которую хочешь преобразовать.'))

# def f(x, y):
#     if x == 1:
#         return y.lower()
#     if x == 2:
#             return y.upper()
#     if x == 3:
#             return y.capitalize()
#     return 0

# print(f(x,y))



# a = str(input('Ведите строку'))
# print(a.find('круто'))
# print(a.index('круто'))
# a = a.replace('круто', 'не круто')
# print(a)
# print(a.count('о'))



# a = str(input('Введите строку.'))
# print('Если хотите вывести список нажмите 1')
# print('Если хотите вывести строку нажмите 2')
# print('Если хотите вывести список и строку нажмите 3')
# x = int(input('Ведите 1,2,3.'))


# def f(x,a):
#     if x == 1:
#         return a.split()
#     if x == 2:
#         return a
#     if x == 3:
#         return a.split(), a
# print(f(x,a))



print('Привет пользователь введите строку и давайте проверим её на разные данные для работы :)')
print('Перед началом нужно пройти опрос: 1) сколько тебе лет? 2) как тебя зовут?') 

b = int(input('Введите ваш возраст: '))
c = str(input('Введите ваше имя: '))
a = str(input('Введите строку: '))

print('Нажми 1 если хочешь проверить строку на наличие только цифр.')
print('Нажми 2 если хочешь проверить строку на наличие только букв.')

x = int(input('Введите число 1,2: '))

def f(x,a):
    if x == 1:
        a = a.strip()
        return a.isdigit()
    if x == 2:
        a = a.strip()
        return a.isalpha()
    
print(f'привет {c}, ваш возраст {b} лет зафиксирован, спаибо за ответ :)')
print('Вот ваша строка: ', f(x,a))